## Ejemplo 5: Concat con DataFrames

### 1. Objetivos:
    - Usar pd.concat para concatenar `DataFrames`
 
---
    
### 2. Desarrollo:

Exactamente los mismos principios aplican a la concatenación de `DataFrames`:

In [2]:
import pandas as pd

In [3]:
data_1 = {
    'column_1': [1, 2, 3],
    'column_2': [4, 5, 6]
}

df_1 = pd.DataFrame(data_1, index=['a', 'b', 'c'])

df_1

   column_1  column_2
a         1         4
b         2         5
c         3         6

In [5]:
data_2 = {
    'column_1': [7, 8, 9],
    'column_2': [10, 11, 12]
}

df_2 = pd.DataFrame(data_1, index=['d', 'e', 'f'])

df_2

   column_1  column_2
d         7        10
e         8        11
f         9        12

Podemos unirlos verticalmente:

In [6]:
pd.concat([df_1, df_2], axis=0)

   column_1  column_2
a         1         4
b         2         5
c         3         6
d         7        10
e         8        11
f         9        12

Horizontalmente:

In [7]:
pd.concat([df_1, df_2], axis=1)

   column_1  column_2  column_1  column_2
a       1.0       4.0       NaN       NaN
b       2.0       5.0       NaN       NaN
c       3.0       6.0       NaN       NaN
d       NaN       NaN       7.0      10.0
e       NaN       NaN       8.0      11.0
f       NaN       NaN       9.0      12.0

Si tienen el mismo índice, evitamos los `NaNs`:

In [8]:
data_3 = {
    'column_3': [7, 8, 9],
    'column_4': [10, 11, 12]
}

df_3 = pd.DataFrame(data_3, index=['a', 'b', 'c'])

df_3

   column_3  column_4
a         7        10
b         8        11
c         9        12

In [9]:
pd.concat([df_1, df_3], axis=1)

   column_1  column_2  column_3  column_4
a         1         4         7        10
b         2         5         8        11
c         3         6         9        12

Si concatenamos verticalmente con el mismo índice, no podemos diferenciarlos:

In [11]:
data_4 = {
    'column_1': [7, 8, 9],
    'column_2': [10, 11, 12]
}

df_4 = pd.DataFrame(data_4, index=['a', 'b', 'c'])

df_4

   column_1  column_2
a         7        10
b         8        11
c         9        12

In [12]:
pd.concat([df_1, df_4], axis=0)

   column_1  column_2
a         1         4
b         2         5
c         3         6
a         7        10
b         8        11
c         9        12

Podemos agregar `multiíndices`:

In [14]:
df_concat = pd.concat([df_1, df_4], axis=0, keys=['df_1', 'df_4'])

df_concat

        column_1  column_2
df_1 a         1         4
     b         2         5
     c         3         6
df_4 a         7        10
     b         8        11
     c         9        12

Y podemos accesarlos de igual manera:

In [15]:
df_concat.loc['df_1']

   column_1  column_2
a         1         4
b         2         5
c         3         6

In [16]:
df_concat.loc[('df_1', 'b')]

column_1    2
column_2    5
Name: (df_1, b), dtype: int64

También podemos unir más de dos `DataFrames` agregándolos todos a la lista:

In [17]:
pd.concat([df_1, df_2, df_3, df_4], axis=1)

,column_1,column_2,column_1,column_2,column_3,column_4,column_1,column_2
a,1.0,4.0,NaN,NaN,7.0,10.0,7.0,10.0
b,2.0,5.0,NaN,NaN,8.0,11.0,8.0,11.0
c,3.0,6.0,NaN,NaN,9.0,12.0,9.0,12.0
d,NaN,NaN,7.0,10.0,NaN,NaN,NaN,NaN
e,NaN,NaN,8.0,11.0,NaN,NaN,NaN,NaN
f,NaN,NaN,9.0,12.0,NaN,NaN,NaN,NaN